Tekla.Structures.DrawingInternal.dotGrMarkBaseAttributes_t


Tekla.Structures.DrawingInternal.dotGrMarkBaseAttributes_t.CommonAttributes


Tekla.Structures.DrawingInternal.dotGrMarkBaseAttributes_t.Angle


Tekla.Structures.DrawingInternal.dotGrMarkBaseAttributes_t.RotationAngle


Tekla.Structures.DrawingInternal.dotGrMarkBaseAttributes_t.TransparentBackground


Tekla.Structures.DrawingInternal.dotGrMarkBaseAttributes_t.TextAlignment


Tekla.Structures.DrawingInternal.dotGrMarkBaseAttributes_t.FontAttributes


Tekla.Structures.DrawingInternal.dotGrMarkBaseAttributes_t.Frame


Tekla.Structures.DrawingInternal.dotGrMarkBaseAttributes_t.ArrowHead


Tekla.Structures.DrawingInternal.dotGrMarkBaseAttributes_t.PreferredPlacingType


Tekla.Structures.DrawingInternal.dotGrMarkBaseAttributes_t.PlacingAttributes


Tekla.Structures.DrawingInternal.dotGrMarkBaseAttributes_t.ModelObjectId


Tekla.Structures.DrawingInternal.dotGrMarkBaseAttributes_t.ClientId


Tekla.Structures.DrawingInternal.dotGrMarkBaseAttributes_t.CustomPresentation


Tekla.Structures.DrawingInternal.dotGrMarkBaseAttributes_t.ToStruct(Tekla.Structures.Drawing.MarkBase.MarkBaseAttributes)


Tekla.Structures.DrawingInternal.dotGrMarkBaseAttributes_t.FromStruct(Tekla.Structures.Drawing.MarkBase.MarkBaseAttributes)
